?- (husband('PrincePhillip', 'QueenElizabethII'))
true .

?- (wife('QueenElizabethII', 'CaptainMarkPhillips'))
false .

?- (father('PrinceCharles', 'AutumnKelly'))
false .

?- (mother('PrincessAnne', 'ZaraPhillips'))
true .

?- (child('MikeTindall', 'TimothyLaurence'))
false .

?- (son('PrincessBeatrice', 'PrinceAndrew'))
false .

?- (daughter('PrincessEugenie', 'SarahFerguson'))
true .

?- (grandparent('QueenElizabethII', 'JamesViscountSevern'))
true .

?- (grandmother('PrincePhillip', 'LadyLouiseMountbatten-Windsor'))
false .

?- (grandfather('PrincePhillip', 'PrincessBeatrice'))
true .

?- (grandchild('PrinceGeorge', 'PrincessAnne'))
false .

?- (grandson('PrincessCharlotte', 'PrinceCharles'))
false .

?- (granddaughter('SavannahPhillips', 'CaptainMarkPhillips'))
true .

?- (sibling('SavannahPhillips', 'IslaPhillips'))
true .

?- (brother('JamesViscountSevern', 'LadyLouiseMountbatten-Windsor'))
true .

?- (sister('PrinceGeorge', 'PrincessCharlotte'))
false .

?- (aunt('PrincessDiana', 'PeterPhillips'))
false .

?- (uncle('PrinceCharles', 'ZaraPhillips'))
true .

?- (niece('PrincessCharlotte', 'PrinceHarry'))
true .

?- (nephew('JamesViscountSevern', 'PrincessBeatrice'))
false .

?- (divorced('PrinceCharles', 'CamillaParkerBowles'))
false .

?- (divorced('SarahFerguson', 'PrinceAndrew'))
true .

?- (parent('SophieRhys-jones', 'PrincessEugenie'))
false .

?- (parent('ZaraPhillips', 'SavannahPhillips'))
false .

?- (parent('MikeTindall', 'MiaGraceTindall'))
true .

?- (male('IslaPhillips'))
false .

?- (male('PeterPhillips'))
true .

?- (female('PrinceAndrew'))
false .

?- (female('PrincessAnne'))
true .

?- (married('PrinceWilliam', 'KateMiddleton'))
true .

?- (married('AutumnKelly', 'MikeTindall'))
false .

?- (husband('PrinceEdward', Wife))
Wife = 'SophieRhys-jones'.

?- (wife('AutumnKelly', Husband))
Husband = 'PeterPhillips'.

?- (father('PrinceWilliam', Child))
Child = 'PrinceGeorge' ;
Child = 'PrincessCharlotte'.

?- (mother('PeterPhillips', Child))
false .

?- (mother('ZaraPhillips', Child))
Child = 'MiaGraceTindall'.

?- (child('PrincessCharlotte', Parent))
Parent = 'PrinceWilliam' ;
Parent = 'KateMiddleton'.

?- (son('JamesViscountSevern', Parent))
Parent = 'PrinceEdward' ;
Parent = 'SophieRhys-jones'.

?- (daughter('PrincessEugenie', Parent))
Parent = 'PrinceAndrew' ;
Parent = 'SarahFerguson'.

?- (grandparent('CaptainMarkPhillips', GC))
GC = 'SavannahPhillips' ;
GC = 'IslaPhillips' ;
GC = 'MiaGraceTindall'.

?- (grandmother('PrincessAnne', GC))
GC = 'SavannahPhillips' ;
GC = 'IslaPhillips' ;
GC = 'MiaGraceTindall'.

?- (grandfather('PrinceCharles', GC))
GC = 'PrinceGeorge' ;
GC = 'PrincessCharlotte'.

?- (grandchild('PrincessCharlotte', GP))
GP = 'PrinceCharles' ;
GP = 'PrincessDiana'.

?- (grandson('PrinceGeorge', GP))
GP = 'PrinceCharles' ;
GP = 'PrincessDiana'.

?- (granddaughter('IslaPhillips', GP))
GP = 'PrincessAnne' ;
GP = 'CaptainMarkPhillips'.

?- (sibling('IslaPhillips', Sibling))
Sibling = 'SavannahPhillips'.

?- (sibling('SavannahPhillips', Sibling))
Sibling = 'IslaPhillips'.

?- (brother('PrinceWilliam', Sibling))
Sibling = 'PrinceHarry'.

?- (sister('ZaraPhillips', Sibling))
Sibling = 'PeterPhillips'.

?- (aunt('CamillaParkerBowles', NieceNephew))
NieceNephew = 'PeterPhillips' ;
NieceNephew = 'ZaraPhillips' ;
NieceNephew = 'PrincessBeatrice' ;
NieceNephew = 'PrincessEugenie' ;
NieceNephew = 'LadyLouiseMountbatten-Windsor' ;
NieceNephew = 'JamesViscountSevern'.

?- (uncle('PrinceAndrew', NieceNephew))
NieceNephew = 'PrinceWilliam' ;
NieceNephew = 'PrinceHarry' ;
NieceNephew = 'PeterPhillips' ;
NieceNephew = 'ZaraPhillips' ;
NieceNephew = 'LadyLouiseMountbatten-Windsor' ;
NieceNephew = 'JamesViscountSevern'.

?- (niece('MiaGraceTindall', AuntUncle))
AuntUncle = 'AutumnKelly' ;
AuntUncle = 'PeterPhillips'.

?- (nephew('PrinceGeorge', AuntUncle))
AuntUncle = 'PrinceHarry'.

