?- (same_vice_chancellor('NguyenThiThanhMai', 'TranMinhTriet', 'HCMUS'))
true .

?- (affiliated_university('Faculties', 'HCMUS'))
true .

?- (branch_unit('MathematicsandComputerScience', 'Faculties'))
true .

?- (branch_unit('ElectronicsandTelecommunications', 'Laboratories'))
false .

?- (departments_same_faculty('Hydrogeology-EngineeringGeology', 'MarineandPetroleumGeology', 'Geolory'))
true .

?- (departments_same_faculty('ComputerScience', 'SoftwareEngineering', 'Physics-EngineeringPhysics'))
false .

?- (departments_same_faculty('PhysicalChemistry', 'InorganicandAppliedChemistry', Faculty))
Faculty = 'Chemistry'.

?- (same_academic_rank('LyQuocNgoc', 'HuynhVanTuan', 'Prof'))
false .

?- (same_academic_rank('LyQuocNgoc', 'HuynhVanTuan', AcademicRank))
AcademicRank = 'Assoc.Prof'.

?- (same_academic_rank('BuiXuanHai', Lecture2, 'Prof'))
Lecture2 = 'TranLeQuan' ;
Lecture2 = 'DangDucTrong' ;
Lecture2 = 'TranLinhThuoc'.

?- (same_academic_degree('LeDucHung', 'PhamKimNgoc', 'M.SC'))
false .

?- (same_academic_degree('LeDucHung', 'PhamKimNgoc', AcademicDegree))
AcademicDegree = 'PhD'.

?- (same_academic_degree('VoDucCamHai', Lecture2, 'M.SC'))
Lecture2 = 'VanChiNam' ;
Lecture2 = 'CaoTranBaThuong' ;
Lecture2 = 'NguyenThuHuong' ;
Lecture2 = 'PhamThanhTung' ;
Lecture2 = 'HoPhamAnhVu' ;
Lecture2 = 'NguyenThiThanhThuy' ;
Lecture2 = 'DoanNguyenVu' ;
Lecture2 = 'TranCongThanh'.

?- (same_academic_titles('NguyenThaiHoang', 'TruongHaiNhung'))
true .

?- (same_faculty('NguyenLeHoangAnh', 'HoangVanHa', 'MathematicsandComputerScience'))
true .

?- (same_faculty('HoangThiDongQuy', 'TonThatQuang', 'MaterialsScienceandTechnology'))
false .

?- (same_faculty('HoangThiDongQuy', Lecture2, 'MaterialsScienceandTechnology'))
Lecture2 = 'TranThiThanhVan' ;
Lecture2 = 'HaThucChiNhan' ;
Lecture2 = 'PhamKimNgoc' ;
Lecture2 = 'LeVanHieu'.

?- (same_department('LeTienKhoa', 'NguyenThiThanhThuy', 'InorganicandAppliedChemistry'))
true .

?- (same_department('NguyenVanVu', 'NguyenThiMinhTuyen', 'ComputerScience'))
false .

?- (same_department('NguyenVanVu', 'NguyenThiMinhTuyen', Department))
Department = 'SoftwareEngineering'.

?- (same_laboratory('TranLinhThuoc', 'PhamVanPhuc', 'StemCellInstitute'))
false .

?- (same_laboratory('TranLinhThuoc', Lecture2, 'CancerResearchLaboratory'))
Lecture2 = 'PhamVanPhuc' ;
Lecture2 = 'DangThiPhuongThao'.

?- (same_laboratory('DangThiPhuongThao', 'PhanThiPhuongTrang', 'MolecularBiotechnologyLaboratory'))
true .

?- (same_academic_rank_faculty('DaoNguyenKhoi', 'ToThiHien'))
true .

?- (same_academic_rank_faculty('DaoNguyenKhoi', Lecture2))
Lecture2 = 'VuVanNghi' ;
Lecture2 = 'ToThiHien'.

?- (same_academic_rank_faculty('NguyenThiKimDung', 'DoanNguyenVu'))
false .

?- (same_academic_rank_department('MaiHoangBien', 'BuiXuanHai'))
false .

?- (same_academic_rank_department('NguyenDinhThuc', 'DinhDien'))
true .

?- (same_academic_rank_laboratory('TranCaoVinh', 'TranQuangTrung'))
true .

?- (same_academic_degree_faculty('TruongHaiNhung', 'NgoDaiNghiep'))
true .

?- (same_academic_degree_faculty('NguyenDucHoang', 'DoanNguyenVu'))
false .

?- (same_academic_degree_department('NguyenThaiHoang', 'HoPhamAnhVu'))
false .

?- (same_academic_degree_department('DangLeKhoa', 'NguyenMinhTri'))
true .

?- (same_academic_degree_laboratory('PhamVanPhuc', 'DangThiPhuongThao'))
true .

?- (same_academic_degree_laboratory('NguyenChiNhan', 'TranVanMan'))
false .

?- (same_academic_titles_faculty('QuachNgoDiemPhuong', 'TranThanhHuong'))
true .

?- (same_academic_titles_department('LeTienKhoa', 'NguyenThiThanhThuy'))
false .

?- (same_academic_titles_laboratory('DangThiPhuongThao', 'PhanThiPhuongTrang'))
true .

?- (dean_same_academic_rank('DaoNguyenKhoi', 'NguyenTrungNhan'))
true .

?- (vice_dean_same_academic_rank('NguyenVanVu', 'TruongHaiNhung'))
true .

?- (dean_same_academic_degree('DinhBaTien', 'PhamTrungHieu'))
true .

?- (vice_dean_same_academic_degree('CaoTranBaThuong', 'NongThiQuynhAnh'))
false .

?- (vice_dean_same_academic_degree('CaoTranBaThuong', ViceDean2))
ViceDean2 = 'VanChiNam' ;
ViceDean2 = 'VoDucCamHai' ;
ViceDean2 = 'NguyenThuHuong'.

?- (head_department_same_academic_rank('NguyenLeHoangAnh', 'DangDucTrong'))
false .

?- (deputy_head_department_same_academic_rank('DinhDien', 'TonThatQuang'))
true .

?- (head_department_same_academic_degree('PhamNguyenCuong', 'NguyenChiNhan'))
true .

?- (deputy_head_department_same_academic_degree('HoPhamAnhVu', 'NguyenMinhTri'))
false .

?- (deputy_head_department_same_academic_degree('HoPhamAnhVu', DeputyHeadDepartment2))
DeputyHeadDepartment2 = 'NguyenThiThanhThuy' ;
DeputyHeadDepartment2 = 'DoanNguyenVu' ;
DeputyHeadDepartment2 = 'TranCongThanh'.

?- (head_lab_same_academic_rank('VuHaiQuan', 'TranLinhThuoc'))
false .

?- (vice_head_lab_same_academic_rank('PhamVanPhuc', 'PhanBachThang'))
true .

?- (head_lab_same_academic_degree('VuHaiQuan', 'TranLinhThuoc'))
true .

?- (vice_head_lab_same_academic_degree('TranMinhTriet', 'PhanThiPhuongTrang'))
true .

?- (vice_chancellor_head_department('NguyenThiThanhMai', 'HCMUS'))
true .

?- (dean_faculty_head_department('MaiHoangBien'))
true .

?- (dean_faculty_head_department('DinhBaTien'))
false .

?- (vice_dean_faculty_head_department('DangLeKhoa'))
true .

?- (vice_dean_faculty_head_department('BuiXuanHai'))
false .

?- (vice_dean_faculty_deputy_head_department('HoangVanHa'))
true .

